doc: polishing readme
